In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [3]:
for i in range(len(df.FlightNumber) - 1):
  if np.isnan(df["FlightNumber"][i]):
    df.FlightNumber[i] = int(df.FlightNumber[i-1] + 10)

  else:
    df.FlightNumber[i] = int(df.FlightNumber[i])

df['FlightNumber'] = df['FlightNumber'].astype(int)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [4]:
#Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)
df['From'] = df['From_To'].apply(lambda x: x.split('_')[0].title()) 
df['To'] = df['From_To'].apply(lambda x: x.split('_')[1].title())

df

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris         10045  ...    London      Paris
1      MAdrid_miLAN         10055  ...    Madrid      Milan
2  londON_StockhOlm         10065  ...    London  Stockholm
3    Budapest_PaRis         10075  ...  Budapest      Paris
4   Brussels_londOn         10085  ...  Brussels     London

[5 rows x 6 columns]

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [5]:
df.drop(columns = 'From_To', inplace = True)

In [6]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each

second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [7]:
delays = pd.DataFrame(df['RecentDelays'].array, columns = ["delay_1", "delay_2", "delay_3"])

In [8]:
df.drop(columns="RecentDelays", inplace = True)
new_data = pd.concat([delays, df], axis = 1)
new_data

   delay_1  delay_2  delay_3  ...              Airline      From         To
0     23.0     47.0      NaN  ...               KLM(!)    London      Paris
1      NaN      NaN      NaN  ...    <Air France> (12)    Madrid      Milan
2     24.0     43.0     87.0  ...  (British Airways. )    London  Stockholm
3     13.0      NaN      NaN  ...       12. Air France  Budapest      Paris
4     67.0     32.0      NaN  ...          "Swiss Air"  Brussels     London

[5 rows x 7 columns]